[
  {
    "id": "shipping",
    "label": "Shipping questions",
    "threshold": 0.32,
    "scope": ["shipping-returns"],
    "examples": [
      "How fast do you ship orders?",
      "Where do you ship A-Minus?",
      "Is shipping free or do I pay extra?",
      "Do you ship outside of the United States?"
    ]
  },
  {
    "id": "returns",
    "label": "Returns and refunds",
    "threshold": 0.32,
    "scope": ["shipping-returns"],
    "examples": [
      "How do I get a refund?",
      "Can I return my first order?",
      "What's your satisfaction guarantee?",
      "Do I have to send the product back for a refund?"
    ]
  },
  {
    "id": "order",
    "label": "Order status or tracking",
    "threshold": 0.33,
    "response": "I can’t access order systems directly, but the team can help right away. Please email info@intelligentmolecules.com with your order number and we’ll take care of it.",
    "examples": [
      "Where is my order?",
      "Can you track my package?",
      "My order hasn’t arrived yet, what’s the status?",
      "How do I check my tracking number?"
    ]
  },
  {
    "id": "product",
    "label": "Product composition or usage",
    "threshold": 0.30,
    "scope": ["a-minus-facts"],
    "examples": [
      "What is in A-Minus?",
      "How does the activated carbon technology work?",
      "When should I take A-Minus after drinking?",
      "How many capsules can I take in a day?"
    ]
  },
  {
    "id": "product-overview",
    "label": "Basic product information",
    "threshold": 0.25,
    "response": "A-Minus is a dietary supplement powered by patent-pending Activated Carbon Technology that selectively adsorbs acetaldehyde in the gut. It contains 100% pure activated carbon and helps bind acetaldehyde before it enters the bloodstream, aiding in its elimination during digestion. It's manufactured in an FDA-registered, GMP-compliant facility in the United States.",
    "examples": [
      "What is A-Minus?",
      "Tell me about A-Minus",
      "What does A-Minus do?"
    ]
  },
  {
    "id": "product-mechanism",
    "label": "How A-Minus works",
    "threshold": 0.25,
    "response": "A-Minus uses patent-pending Activated Carbon Technology tuned for selective adsorption of acetaldehyde in the gut. When you drink alcohol, your body metabolizes ethanol into acetaldehyde—a toxin that contributes to hangover symptoms. A-Minus binds this acetaldehyde before it enters your bloodstream, helping your body eliminate it during normal digestion. The activated carbon delivers ~20× higher acetaldehyde adsorption versus generic activated charcoal.",
    "examples": [
      "How does A-Minus work?",
      "What's the science behind A-Minus?",
      "How does activated carbon technology work?"
    ]
  },
  {
    "id": "product-ingredients",
    "label": "A-Minus ingredients",
    "threshold": 0.25,
    "response": "A-Minus contains 700mg of activated carbon (100% pure carbon) per serving (2 capsules). The capsules are made from hydroxypropyl methylcellulose (HPMC). That's it—no fillers, additives, or other ingredients. The activated carbon is specifically tuned for acetaldehyde adsorption and manufactured in an FDA-registered, GMP-compliant facility in the United States.",
    "examples": [
      "What are the ingredients in A-Minus?",
      "What is A-Minus made of?",
      "What's in A-Minus?"
    ]
  },
  {
    "id": "product-usage",
    "label": "How to take A-Minus",
    "threshold": 0.25,
    "response": "Take 2 capsules (1 serving) after alcohol consumption—as soon as possible after your last drink—with a large glass of water. Use 1 serving per ~4-5 drinks of alcohol. Maximum: Do not exceed 4 servings (8 capsules) in 24 hours. Can be taken with or without food. Leave 2 hours between A-Minus and any prescription or OTC medications.",
    "examples": [
      "How do I take A-Minus?",
      "When should I take A-Minus?",
      "What's the dosage for A-Minus?"
    ]
  }
]
